In [1]:
import os
import pandas as pd
from typing import Optional, Sequence, Union

pd.set_option('display.max_columns', None)

from core import *

In [5]:
df = load_data(r'D:\Documents\Python\CREATE_DATA\airline_names.xlsx')

In [3]:
#df = df[['operating_airline','published_airline']]
#df = df[['activity_period']]
df.head()

,activity_period,operating_airline,operating_airline_iata,published_airline,published_airline_iata,geo_summary,geo_region,activity_type,price_category,terminal,boarding_area,passenger_count
0,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,Terminal 1,B,27271
1,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Enplaned,Low Fare,Terminal 1,B,29131
2,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Thru / Transit,Low Fare,Terminal 1,B,5415
3,200507,Air Canada,AC,Air Canada,AC,International,Canada,Deplaned,Other,Terminal 1,B,35156
4,200507,Air Canada,AC,Air Canada,AC,International,Canada,Enplaned,Other,Terminal 1,B,34090

In [4]:
profile(df)

ROW TOTAL = 22,869 COLUMNS = 12

,Variable Name,Variable Type,Missing Count,% Blank,Unique Values,Most Frequent Value,count,unique,top,freq,mean,std,min,25%,Median,75%,max
0,activity_period,int64,0,0,186,201806,22869,NaN,NaN,NaN,201307.19,448.69,200507.0,200907.0,201309.0,201707.0,202012.0
1,operating_airline,object,0,0,95,United Airlines,22869,95,United Airlines,2396,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,operating_airline_iata,object,74,0,88,UA,22795,88,UA,4550,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,published_airline,object,0,0,85,United Airlines,22869,85,United Airlines,2871,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,published_airline_iata,object,74,0,79,UA,22795,79,UA,5516,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,geo_summary,object,0,0,2,International,22869,2,International,14720,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,geo_region,object,0,0,9,US,22869,9,US,8149,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,activity_type,object,0,0,3,Enplaned,22869,3,Enplaned,10891,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,price_category,object,0,0,2,Other,22869,2,Other,20194,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,terminal,object,0,0,5,International,22869,5,International,14795,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,boarding_area,object,0,0,8,A,22869,8,A,8023,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,passenger_count,int64,0,0,16018,1,22869,NaN,NaN,NaN,29205.21,61210.50,1.0,4965.0,8892.0,19908.0,659837.0

In [27]:
df.attrs['N'] = 5

In [28]:
df.attrs

{'N': 5}

In [3]:
df.dtypes

activity_period            int64
operating_airline         object
operating_airline_iata    object
published_airline         object
published_airline_iata    object
geo_summary               object
geo_region                object
activity_type             object
price_category            object
terminal                  object
boarding_area             object
passenger_count            int64
dtype: object

In [45]:
def profile_good(df: pd.DataFrame) -> pd.DataFrame:
    """
    PURPOSE
    -------
    Create a data profile of a pandas DataFrame to assess data quality.

    Parameters
    ----------
    df : pd.DataFrame
        Input dataset.

    Returns
    -------
    pd.DataFrame
        A summary with column metadata, missingness, uniqueness, and numeric stats.
        Row/column counts are also stored in `result.attrs['n_rows']` and `['n_cols']`.
    """
    n_row, n_col = df.shape

    # Basic summary
    summary = pd.DataFrame({
        "Variable Name": df.columns,
        "Variable Type": df.dtypes.astype(str),
        "Missing Count": df.isna().sum(),
        "% Blank": (df.isna().mean() * 100).round(0).astype("Int64"),
        "Unique Values": df.nunique(dropna=True),
        "Most Frequent Value": df.apply(
            lambda col: col.mode(dropna=True).iloc[0] if not col.mode(dropna=True).empty else pd.NA
        ),
    })

    # Universal describe (works for text-only, numeric-only, or mixed)
    desc = (
        df.describe(include="all")
          .T
          .reset_index()
          .rename(columns={"index": "Variable Name", "50%": "Median"})
    )

    # Round numeric-looking stats if present (coerce non-numerics to NaN, which stay untouched)
    for col in ["mean", "std", "min", "25%", "Median", "75%", "max"]:
        if col in desc.columns:
            desc[col] = pd.to_numeric(desc[col], errors="coerce").round(2)

    # Merge and return
    final = summary.merge(desc, on="Variable Name", how="left")

    return final

In [ ]:
profile_good(df)

,Variable Name,Variable Type,Missing Count,% Blank,Unique Values,Most Frequent Value,count,unique,top,freq,mean,std,min,25%,Median,75%,max
0,activity_period,int64,0,0,186,201806,22869.0,NaN,NaN,NaN,201307.19,448.69,200507.0,200907.0,201309.0,201707.0,202012.0
1,operating_airline,object,0,0,95,United Airlines,22869,95,United Airlines,2396,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,operating_airline_iata,object,74,0,88,UA,22795,88,UA,4550,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,published_airline,object,0,0,85,United Airlines,22869,85,United Airlines,2871,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,published_airline_iata,object,74,0,79,UA,22795,79,UA,5516,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,geo_summary,object,0,0,2,International,22869,2,International,14720,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,geo_region,object,0,0,9,US,22869,9,US,8149,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,activity_type,object,0,0,3,Enplaned,22869,3,Enplaned,10891,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,price_category,object,0,0,2,Other,22869,2,Other,20194,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,terminal,object,0,0,5,International,22869,5,International,14795,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,boarding_area,object,0,0,8,A,22869,8,A,8023,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,passenger_count,int64,0,0,16018,1,22869.0,NaN,NaN,NaN,29205.21,61210.50,1.0,4965.0,8892.0,19908.0,659837.0

In [15]:
def d_dict(df0):
    n_row, n_col = df0.shape
    r_total = "{:,}".format(n_row)
    print("ROW TOTAL = " + str(r_total) + " COLUMNS = " + str(n_col))

    summary = pd.DataFrame(df0.dtypes)

    percent_missing = list(df0.isnull().sum() * 100 / len(df0))
    summary.insert(1, '%_Blank', percent_missing)
    summary = summary.reset_index()
    summary.columns = ['Variable_Name', 'Variable_Type', '%_Blank']

    sum_stats = df0.describe().T
    sum_stats = sum_stats.reset_index()

    final_summary = pd.merge(summary, sum_stats, how = 'left', left_on = 'Variable_Name', right_on = 'index')
    final_summary = final_summary.reset_index()
    final_summary = final_summary.iloc[:, 1:] # drop the firt column
    del final_summary['index']
    return(final_summary)

In [ ]:
d_dict(df)

ROW TOTAL = 22,869 COLUMNS = 2

,Variable_Name,Variable_Type,%_Blank,count,unique,top,freq
0,operating_airline,object,0.0,22869,95,United Airlines,2396
1,published_airline,object,0.0,22869,85,United Airlines,2871